#### Pandas read_excel to get dataframes

In [1]:
import pandas as pd

report = pd.read_excel('../datasets/Sales_report.xlsx', header=4, sheet_name='LOWER TH', usecols=[i for i in range(0,13)])
report

  SalesRep   JAN   FEB   MAR   APR   MAY   JUN   JUL  AUG  SEP  OCT  NOV  DEC
0   LTH101  7579  1676  9065  7908  3421  2384     0    0    0    0    0    0
1   LTH102  9390  7727  5586  8701  8897  6313  8270    0    0    0    0    0
2   LTH103  3217  5614  5480  4661  2351  6009  8763    0    0    0    0    0
3   LTH104  1545  3906  2815  3293  4198  6032  4777    0    0    0    0    0
4   LTH105  9394  4313  1256  6760  7756  4397  8649    0    0    0    0    0

In [2]:
len(report.columns)

13

In [3]:
[i for i in range(0,13)]

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]

#### Openpyxl to get worksheets

In [4]:
!pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\natanop\anaconda3\lib\site-packages (3.0.5)
Requirement already satisfied: et-xmlfile in c:\users\natanop\anaconda3\lib\site-packages (from openpyxl) (1.0.1)
Requirement already satisfied: jdcal in c:\users\natanop\anaconda3\lib\site-packages (from openpyxl) (1.4.1)

In [5]:
from openpyxl import load_workbook
wb = load_workbook(filename='../datasets/Sales_report.xlsx')
print(wb.sheetnames)

['Bangkok 1', 'Bangkok 2', 'UPPER TH', 'LOWER TH']

In [6]:
# loop sheetnames
for ws in wb.sheetnames:
    print(ws)

Bangkok 1
Bangkok 2
UPPER TH
LOWER TH

#### Putting them together

In [7]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [8]:
reports = pd.DataFrame()
for ws in wb.sheetnames:
    print(ws)
    report = pd.read_excel('../datasets/Sales_report.xlsx', header=4, sheet_name=ws, usecols=[i for i in range(0,13)])
    #print(report.head(3))
    reports = pd.concat([reports, report])
    
reports.head()

Bangkok 1
Bangkok 2
UPPER TH
LOWER TH

,SalesRep,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC
0,BKK1101,97072,21940,66845,95139,22191,47206,20101,0,0,0,0,0
1,BKK1102,54712,39768,59924,52795,68737,19204,84671,0,0,0,0,0
2,BKK1103,48605,47062,26368,21318,57240,76288,47029,0,0,0,0,0
0,BKK2101,21028,83026,54439,55905,25539,88417,52263,0,0,0,0,0
1,BKK2102,46199,59359,25178,38881,66489,14368,67252,0,0,0,0,0

In [9]:
report.columns[1:]

Index(['JAN', 'FEB', 'MAR', 'APR', 'MAY', 'JUN', 'JUL', 'AUG', 'SEP', 'OCT',
       'NOV', 'DEC'],
      dtype='object')

In [10]:
mlt_report = pd.melt(reports, id_vars='SalesRep', value_vars=report.columns[1:],
                     var_name='Month', value_name='Sales')

In [11]:
mlt_report.to_csv('../datasets/output_sales_report.csv', index=False)

In [12]:
mlt_report.groupby('Month').sum()

        Sales
Month
APR    522611
AUG         0
DEC         0
FEB    460430
JAN    530061
JUL    481208
JUN    382428
MAR    539484
MAY    458265
NOV         0
OCT         0
SEP         0